import me.zhenxin.zmusic.entity.LyricRaw
import me.zhenxin.zmusic.utils.formatLyric

/**
 * 测试
 *
 * @author 真心
 * @since 2022/1/9 12:42
 */
fun main() {
    var i = 0
    var formatted: List<LyricRaw>

    val lyric =
        "[00:00.000] 作词 : Puru\n[00:01.000] 作曲 : Daan Speelman/Joost Speelman/Lars Boom\n[00:07.370]柔らかい毛 たまらない肉球\n[00:12.700]この世の物とは思えない感触\n[00:16.380]\n[00:18.090]しなやかなボディ 闇に光る眼\n[00:23.660]狙った獲物逃さない スナイパー\n[00:27.420]\n[00:29.330]障子は破くし 網戸は登るし\n[00:34.720]悪行やりつくして 君は僕にこう叫ぶ\n[00:41.550]\n[00:42.100]お腹空いたら にゃにゃにゃにゃーにゃー\n[00:44.530]機嫌悪けりゃ しゃしゃしゃしゃーしゃー\n[00:47.420]いつも自由な 猫に夢中\n[00:52.570]ずっとすまし顔 常にマイペース\n[00:58.150]コタツの中でひとり 喉を鳴らす\n[01:01.420]ゴロゴロゴロ~\n[01:03.480]寂しがりなのに 一人が好き\n[01:09.220]しつこくかまい過ぎると 喰らう\n[01:12.300]ネコパンチ パララッパパンパンチ!\n[01:14.740]マタタビで酔うし ご飯は良く食べるし\n[01:20.350]気ままに日々過ごして 君は僕にこう叫ぶ\n[01:27.060]\n[01:27.490]遊びたいなら にゃにゃにゃにゃーにゃー\n[01:30.180]知らない人には しゃしゃしゃしゃーしゃー\n[01:32.710]いつも自由な 猫に夢中\n[01:37.690]やがて陽も沈んで 夜も段々更け始めて\n[01:43.780]眠くなったら甘えだして 前足フミフミ足踏みをして\n[01:49.210]冬なら毛布の中に入って 夏なら涼しい布団の端で\n[01:54.700]いつも振り回されてるのに ぼくらは“ねこネコ猫中毒”さ\n[02:00.630]お腹空いたら にゃにゃにゃにゃーにゃー\n[02:03.400]機嫌悪けりゃ しゃしゃしゃしゃーしゃー\n[02:05.850]いつも自由な 猫に夢中\n[02:11.280]\n[02:12.350]上传：乃王木木Eileen\n[02:27.740]\n"
    val lyricTranslation =
        "[by:夜雨无回]\n[00:07.370]柔软的毛发 可爱到无法忍受的肉球\n[00:12.700]简直是这世界上无法想象的触感\n[00:18.090]灵活扭动的身体 黑暗里发光的眼睛\n[00:23.660]绝对不会放走猎物的狙击手\n[00:29.330]纸门也一巴掌糊破 在纱窗上也爬来爬去\n[00:34.720]什么坏事都被你干尽了 你这样冲着我大叫\n[00:42.100]肚子饿扁了就要 喵喵喵~喵~喵~\n[00:44.530]心情不爽了就 沙沙沙~沙~沙~\n[00:47.420]每天沉迷自由自在的喵星人无法自拔\n[00:52.570]高贵冷艳的表情 总是自我为中心\n[00:58.150]在被炉里面 独自用喉咙发出声响\n[01:01.420]咕噜~咕噜~咕噜\n[01:03.480]明明很害怕寂寞 却喜欢一个人呆着\n[01:09.220]一直纠缠不休的话 吃我一记\n[01:12.300]喵喵拳 啪嘭噗叽啪嘿\n[01:14.740]沉醉于木天蓼 饭量超级大\n[01:20.350]每天像咸鱼一样无所事事 你这样冲着我大叫\n[01:27.490]想出去玩了就要 喵喵喵~喵~喵~\n[01:30.180]对于不认识的家伙就会 沙沙沙~沙~沙~\n[01:32.710]每天沉迷自由自在的喵星人无法自拔\n[01:37.690]太阳马上就要下山了 夜幕也开始降临\n[01:43.780]犯困想要睡觉就拼命撒娇 前爪子不停的向前扒拉\n[01:49.210]冬天一到就钻进暖暖的毛毯 夏天到了就坐到凉席旁边\n[01:54.700]明明我们都被喵星人差使的团团转 但是我们就是猫咪中毒\n[02:00.630]肚子饿扁了就要 喵喵喵~喵~喵~\n[02:03.400]心情不爽了就 沙沙沙~沙~沙~\n[02:05.850]每天沉迷自由自在的喵星人无法自拔\n"

    formatted = formatLyric(lyric, lyricTranslation)
    println(formatted)
}